matsstaff/stc1000p/src/page0.c
/*
 * STC1000+, improved firmware and Arduino based firmware uploader for the STC-1000 dual stage thermostat.
 *
 * Copyright 2014 Mats Staffansson
 *
 * This file is part of STC1000+.
 *
 * STC1000+ is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * STC1000+ is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with STC1000+.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

#include "stc1000p.h"

/* Configuration words */
unsigned int __at _CONFIG1 __CONFIG1 = 0xFD4;
unsigned int __at _CONFIG2 __CONFIG2 = 0x3AFF;

/* Temperature lookup table  */
#ifdef FAHRENHEIT
	const int ad_lookup[] = { 0, -555, -319, -167, -49, 48, 134, 211, 282, 348, 412, 474, 534, 593, 652, 711, 770, 831, 893, 957, 1025, 1096, 1172, 1253, 1343, 1444, 1559, 1694, 1860, 2078, 2397, 2987 };
#else  // CELSIUS
	const int ad_lookup[] = { 0, -486, -355, -270, -205, -151, -104, -61, -21, 16, 51, 85, 119, 152, 184, 217, 250, 284, 318, 354, 391, 431, 473, 519, 569, 624, 688, 763, 856, 977, 1154, 1482 };
#endif

/* LED character lookup table (0-9) */
unsigned const char led_lookup[] = { LED_0, LED_1, LED_2, LED_3, LED_4, LED_5, LED_6, LED_7, LED_8, LED_9 };

/* Global variables to hold LED data (for multiplexing purposes) */
led_e_t led_e = {0xff};
led_t led_10, led_1, led_01;

/* Global state flags for various optimizations (uses fewer instructions and data space vs 1/0 chars) */
union {
	unsigned char raw;
	struct {
		unsigned ad_badrange       : 1;  // used for adc range checking
#if defined(COM)
		unsigned com_write         : 1;
#else
		unsigned                   : 1;
#endif
		unsigned bool              : 1;  // a generic single-bit flag for local function use
		unsigned                   : 1;
		unsigned                   : 1;
		unsigned                   : 1;
		unsigned                   : 1;
		unsigned                   : 1;
	};
} state_flags = {0};

static int temperature=0;

#if defined(OVBSC)
led_t al_led_10, al_led_1, al_led_01;
int setpoint=0;
int output=0;
static int thermostat_output=0;
#endif
#if defined(PB2)
static int temperature2=0;
#elif defined(COM)
typedef union {
	unsigned char raw;
	struct {
		unsigned com_recv_addr      : 1;
		unsigned com_recv_data1     : 1;
		unsigned com_recv_data2     : 1;
		unsigned com_recv_checksum  : 1;
		unsigned com_trans_data1    : 1;
		unsigned com_trans_data2    : 1;
		unsigned com_trans_checksum : 1;
		unsigned com_trans_ack      : 1;
	};
} com_states_t;

static volatile unsigned char com_data=0;
static volatile unsigned char com_tmout=0;
static volatile unsigned char com_count=0;
static volatile com_states_t com_state = { 0 };
#elif defined(FO433)
static volatile unsigned char fo433_data=0;
static unsigned char fo433_state=0;
static volatile unsigned char fo433_count=0;
static volatile unsigned char fo433_send_space=0;
static unsigned char fo433_sec_count = 24;
#endif
#if defined(MINUTE)
int setpoint;
unsigned int curr_dur = 0;
#endif
#if defined(RH)
#define AD_0_RH			169
#define AD_100_RH		813
static unsigned char 	humidity=0;
static unsigned int 	wait=0;
#endif

/* Functions.
 * Note: Functions used from other page cannot be static, but functions
 * not used from other page SHOULD be static to decrease overhead.
 * Functions SHOULD be defined before used (ie. not just declared), to
 * decrease overhead. Refer to SDCC manual for more info.
 */

/* Read one configuration data from specified address.
 * arguments: Config address (0-127)
 * return: the read data
 */
unsigned int eeprom_read_config(unsigned char eeprom_address){
	unsigned int data = 0;
	eeprom_address = (eeprom_address << 1);

	do {
		EEADRL = eeprom_address; // Data Memory Address to read
		CFGS = 0; // Deselect config space
		EEPGD = 0; // Point to DATA memory
		RD = 1; // Enable read

		data = ((((unsigned int) EEDATL) << 8) | (data >> 8));
	} while(!(eeprom_address++ & 0x1));

	return data; // Return data
}

/* Store one configuration data to the specified address.
 * arguments: Config address (0-127), data
 * return: nothing
 */
void eeprom_write_config(unsigned char eeprom_address,unsigned int data)
{
	// Avoid unnecessary EEPROM writes
//	if(data == eeprom_read_config(eeprom_address)){
//		return;
//	}

	// multiply address by 2 to get eeprom address, as we will be storing 2 bytes.
	eeprom_address = (eeprom_address << 1);

	do {
		// Address to write
	    EEADRL = eeprom_address;
	    // Data to write
	    EEDATL = (unsigned char) data;
	    // Deselect configuration space
	    CFGS = 0;
	    //Point to DATA memory
	    EEPGD = 0;
	    // Enable write
	    WREN = 1;

	    // Disable interrupts during write
	    GIE = 0;

	    // Write magic words to EECON2
	    EECON2 = 0x55;
	    EECON2 = 0xAA;

	    // Initiate a write cycle
	    WR = 1;

	    // Re-enable interrupts
	    GIE = 1;

	    // Disable writes
	    WREN = 0;

	    // Wait for write to complete
	    while(WR);

	    // Clear write complete flag (not really needed
	    // as we use WR for check, but is nice)
	    EEIF=0;

	    // Shift data for next pass
	    data = data >> 8;

	} while(!(eeprom_address++ & 0x01)); // Run twice for 16 bits

}

/* Update LED globals with temperature or integer data.
 * arguments: value (actual temperature multiplied by 10 or an integer)
 *            ledformat bitfield indicating the input format. (see LEDFORMAT_XXX bits)
 * return: nothing
 */
void value_to_led(int value, unsigned char ledformat) {
	unsigned char i;

	// Handle negative values
	if (value < 0) {
		led_e.e_negative = 0;
		value = -value;
	} else {
		led_e.e_negative = 1;
	}

	if(ledformat & LEDFORMAT_DEGREES){
		led_e.e_deg = 0;
#ifdef FAHRENHEIT
		led_e.e_c = 1;
#else
		led_e.e_c = 0;
#endif // FAHRENHEIT
	} else {
		led_e.e_deg = 1;
		led_e.e_c = 1;
	}

	// If temperature >= 100 we must lose decimal...
	if (value >= 1000) {
		ledformat = LEDFORMAT_NONE;
	} else { // Otherwise multiply by 10
		value += (value << 3) + value;
	}

	// Convert value to BCD and set LED outputs
	if(value >= 1000){
		for(i=0; value >= 1000; i++){
			value -= 1000;
		}
		led_10.raw = led_lookup[i];
	} else {
		led_10.raw = LED_OFF; // Turn off led if zero (lose leading zeros)
		if((value < 100) && !(ledformat & LEDFORMAT_DECIMAL)){
			led_1.raw = LED_OFF; // Turn off led if zero (lose leading zeros)
			goto last_digit_label;
		}
	}

	for(i=0; value >= 100; i++){
		value -= 100;
	}
	led_1.raw = led_lookup[i];
	if(ledformat & LEDFORMAT_DECIMAL){
		led_1.decimal = 0;
	}

last_digit_label:
	// Re-use ledformat variable. saves a few instrucions
#define value8 ledformat
	value8 = value;
	for(i=0; value8 >= 10; i++){
		value8 -= 10;
	}
#undef value8
	led_01.raw = led_lookup[i];
}

#if defined OVBSC
static unsigned char output_counter=0;
static void output_control(){
	static unsigned char o, inv;
	
	if(output_counter == 0){
		output_counter = 100;
		if(output < 0){
			o = -output;
			inv = 1;
		}else{
			o = output;
			inv = 0;
		}
	}
	output_counter--;

	LATA0 = 0;
	led_e.e_point = 1;
	if(ALARM){
		LATA0 = (output_counter > 75);
	} else if(PAUSE && !OFF){
		led_e.e_point = output_counter & 0x1;
	}

	if(PAUSE || OFF){
		LATA5 = 0;
		LATA4 = 0;
		PUMP_OFF();
	} else {
		unsigned char e1=(o > output_counter);
		unsigned char e2=(o > (output_counter+100));

