matsstaff/stc1000p/src/page0.c
		if(inv){
			LATA5 = e2;
			LATA4 = e1;
		}else{
			LATA5 = e1;
			LATA4 = e2;
		}

		if(PUMP){
			PUMP_MANUAL();
		} else {
			PUMP_OFF();
		}

	}

	led_e.e_heat = !LATA5;
	led_e.e_cool = !LATA4;
}

static void temperature_control(){
	if(THERMOSTAT){
		if(temperature < setpoint){
			output = thermostat_output;
		} else {
			output = 0;
		}
	}
}

unsigned char prg_state=0;
unsigned int countdown=0;
unsigned char mashstep=0;
static void program_fsm(){
	static unsigned char sec_countdown=60;

	if(OFF){
		prg_state = prg_off;
		return;
	}

	if(PAUSE){
		return;
	}

	if(countdown){
		if(sec_countdown==0){
			sec_countdown=60;
			countdown--;
		}
		sec_countdown--;
	}

	switch(prg_state){
		case prg_off:
			if(RUN_PRG){
				countdown = eeprom_read_config(EEADR_MENU_ITEM(Sd)); 	/* Strike delay */
				prg_state = prg_wait_strike;
			} else {
				if(THERMOSTAT){
					setpoint = eeprom_read_config(EEADR_MENU_ITEM(cSP));
					thermostat_output = eeprom_read_config(EEADR_MENU_ITEM(cO));
				} else {
					output = eeprom_read_config(EEADR_MENU_ITEM(cO));
				}
				PUMP = eeprom_read_config(EEADR_MENU_ITEM(cP));
			}
		break;
		case prg_wait_strike:
			output = 0;
			THERMOSTAT = 0;
			PUMP=0;
			if(countdown == 0){
				countdown = eeprom_read_config(EEADR_MENU_ITEM(ASd));
				prg_state = prg_strike;
			}
		break;
		case prg_strike:
			setpoint = eeprom_read_config(EEADR_MENU_ITEM(St)); /* Strike temp */
			output = eeprom_read_config(EEADR_MENU_ITEM(SO));
			PUMP=(eeprom_read_config(EEADR_MENU_ITEM(PF)) >> 0) & 0x1;
			if(temperature >= setpoint){
				THERMOSTAT = 1;
				thermostat_output = eeprom_read_config(EEADR_MENU_ITEM(PO));
				ALARM = (eeprom_read_config(EEADR_MENU_ITEM(APF)) >> 0) & 0x1;
				al_led_10.raw = LED_S;
				al_led_1.raw = LED_t;
				al_led_01.raw = LED_OFF;
				countdown = eeprom_read_config(EEADR_MENU_ITEM(ASd));
				prg_state = prg_strike_wait_alarm;
			} else if(countdown == 0){
				OFF=1;
			}
		break;
		case prg_strike_wait_alarm:
			if(!ALARM){
				PAUSE = (eeprom_read_config(EEADR_MENU_ITEM(APF)) >> 1) & 0x1;
				mashstep=0;
				countdown = eeprom_read_config(EEADR_MENU_ITEM(ASd));
				prg_state = prg_init_mash_step;
			} else if(countdown == 0){
				OFF=1;
			}
		break;
		case prg_init_mash_step:
			setpoint = eeprom_read_config(EEADR_MENU_ITEM(Pt1) + (mashstep << 1)); /* Mash step temp */
			output = eeprom_read_config(EEADR_MENU_ITEM(SO));
			THERMOSTAT = 0;
			PUMP=(eeprom_read_config(EEADR_MENU_ITEM(PF)) >> 1) & 0x1;
			if(temperature >= setpoint || (eeprom_read_config(EEADR_MENU_ITEM(Pd1) + (mashstep << 1)) == 0)){
				countdown = eeprom_read_config(EEADR_MENU_ITEM(Pd1) + (mashstep << 1)); /* Mash step duration */
				prg_state = prg_mash;
			} else if(countdown==0){
				OFF=1;
			}
		break;
		case prg_mash:
			THERMOSTAT = 1;
			thermostat_output = eeprom_read_config(EEADR_MENU_ITEM(PO));
			PUMP=(eeprom_read_config(EEADR_MENU_ITEM(PF)) >> 2) & 0x1;
			if(countdown==0){
				mashstep++;
				if(mashstep < 6){
					countdown = eeprom_read_config(EEADR_MENU_ITEM(ASd));
					prg_state = prg_init_mash_step;
				} else {
					ALARM = (eeprom_read_config(EEADR_MENU_ITEM(APF)) >> 2) & 0x1;
					al_led_10.raw = LED_b;
					al_led_1.raw = LED_U;
					al_led_01.raw = LED_OFF;
					countdown = eeprom_read_config(EEADR_MENU_ITEM(ASd));
					prg_state = prg_wait_boil_up_alarm;
				}
			}
		break;
		case prg_wait_boil_up_alarm:
			if(!ALARM){
				PAUSE = (eeprom_read_config(EEADR_MENU_ITEM(APF)) >> 3) & 0x1;
				countdown = eeprom_read_config(EEADR_MENU_ITEM(ASd));
				prg_state = prg_init_boil_up;
			} else if(countdown == 0){
				OFF=1;
			}
		break;
		case prg_init_boil_up:
			THERMOSTAT = 0;
			PUMP=(eeprom_read_config(EEADR_MENU_ITEM(PF)) >> 3) & 0x1;
			output = eeprom_read_config(EEADR_MENU_ITEM(SO)); /* Boil output */
			if(temperature >= eeprom_read_config(EEADR_MENU_ITEM(Ht))){ /* Boil up temp */
				countdown = eeprom_read_config(EEADR_MENU_ITEM(Hd)); /* Hotbreak duration */
				prg_state = prg_hotbreak;
			} else if(countdown==0){
				OFF=1;
			}
		break;
		case prg_hotbreak:
			output = eeprom_read_config(EEADR_MENU_ITEM(HO)); /* Hot break output */
			PUMP=(eeprom_read_config(EEADR_MENU_ITEM(PF)) >> 4) & 0x1;
			if(countdown==0){
				countdown = eeprom_read_config(EEADR_MENU_ITEM(bd)); /* Boil duration */ 
				prg_state = prg_boil;
			}
		break;
		case prg_boil:
			PUMP = 0;
			output = eeprom_read_config(EEADR_MENU_ITEM(bO)); /* Boil output */
			{
				unsigned char i;
				for(i=0; i<4; i++){
					if(countdown == eeprom_read_config(EEADR_MENU_ITEM(hd1) + i) && sec_countdown > 57){ /* Hop timer */
						ALARM = (eeprom_read_config(EEADR_MENU_ITEM(APF)) >> (4+i)) & 0x1;
						al_led_10.raw = LED_h;
						al_led_1.raw = LED_d;
						al_led_01.raw = led_lookup[i+1];
						break;
					}
				}
			}
			if(countdown == 0){
				output = 0;
				THERMOSTAT = 0;
				OFF = 1;
				ALARM = (eeprom_read_config(EEADR_MENU_ITEM(APF)) >> 8) & 0x1;
				al_led_10.raw = LED_C;
				al_led_1.raw = LED_h;
				al_led_01.raw = LED_OFF;
				RUN_PRG = 0;
				prg_state = prg_off;
			}
		break;

	} // switch(prg_state)

}

#elif defined RH

#else // !OVBSC !RH

/* To be called once every hour on the hour.
 * Updates EEPROM configuration when running profile.
 */
static void update_profile(){
	unsigned char profile_no = eeprom_read_config(EEADR_MENU_ITEM(rn));

	// Running profile?
	if (profile_no < THERMOSTAT_MODE) {
		unsigned char curr_step = eeprom_read_config(EEADR_MENU_ITEM(St));
		unsigned char profile_step_eeaddr;
		unsigned int profile_step_dur;
		int profile_next_step_sp;
#if defined MINUTE
		curr_dur++;
#else
		unsigned int curr_dur = eeprom_read_config(EEADR_MENU_ITEM(dh)) + 1;
#endif

		// Sanity check
		if(curr_step > 8){
			curr_step = 8;
		}

		profile_step_eeaddr = EEADR_PROFILE_SETPOINT(profile_no, curr_step);
		profile_step_dur = eeprom_read_config(profile_step_eeaddr + 1);
		profile_next_step_sp = eeprom_read_config(profile_step_eeaddr + 2);

		// Reached end of step?
		if (curr_dur >= profile_step_dur) {
			// Update setpoint with value from next step
#if defined MINUTE
			setpoint = profile_next_step_sp;
#endif
			eeprom_write_config(EEADR_MENU_ITEM(SP), profile_next_step_sp);
			// Is this the last step (next step is number 9 or next step duration is 0)?
			if (curr_step == 8 || eeprom_read_config(profile_step_eeaddr + 3) == 0) {
				// Switch to thermostat mode.
				eeprom_write_config(EEADR_MENU_ITEM(rn), THERMOSTAT_MODE);
				return; // Fastest way out...
			}
			// Reset duration
			curr_dur = 0;
			// Update step
			curr_step++;
			eeprom_write_config(EEADR_MENU_ITEM(St), curr_step);
		} else if(eeprom_read_config(EEADR_MENU_ITEM(rP))) { // Is ramping enabled?
			int profile_step_sp = eeprom_read_config(profile_step_eeaddr);
			unsigned int t = curr_dur << 6;
			long sp = 32;
			unsigned char i;

			// Linear interpolation calculation of new setpoint (64 substeps)
			for (i = 0; i < 64; i++) {
			 int sp_temp;
			 if (t >= profile_step_dur) {
			    t -= profile_step_dur;
			    sp_temp = profile_next_step_sp;
			  } else {
			    sp_temp = profile_step_sp;
			  }
			    sp += sp_temp;
			}
			sp >>= 6;

			// Update setpoint
#if defined MINUTE
			setpoint = sp;
		}
#else
			eeprom_write_config(EEADR_MENU_ITEM(SP), sp);
		}
		// Update duration
		eeprom_write_config(EEADR_MENU_ITEM(dh), curr_dur);
#endif
	}
}

/* Due to a fault in SDCC, static local variables are not initialized
 * properly, so the variables below were moved from temperature_control()
 * and made global.
 */
unsigned char cooling_delay = 1;  // Initial cooling delay
unsigned char heating_delay = 1;  // Initial heating delay
unsigned char delay_minute_countdown = 60;
#if defined(PB2)
int error_integrator = 0;
#endif
static void temperature_control(){
#ifndef MINUTE
	int setpoint = eeprom_read_config(EEADR_MENU_ITEM(SP));
#endif
#if defined(PB2)
	int setpoint2;
#define	sp	setpoint2
#define temp	temperature2
#else
#define sp	setpoint
#define temp	temperature
#endif

	if(delay_minute_countdown){
		delay_minute_countdown--;
	} else {
		if(cooling_delay){
			cooling_delay--;
		}
		if(heating_delay){
			heating_delay--;
		}
		delay_minute_countdown = 60;
#if defined(PB2)
		{
			int error = setpoint - temperature;
			unsigned char ec = eeprom_read_config(EEADR_MENU_ITEM(EC));

			if(error > 0){
				if(error_integrator < 32704){
					error_integrator += ec;
				}
			} else if(error < 0) {
				if(error_integrator > -32705){
					error_integrator -= ec;
				}
			}
		}
#endif
	}

#if defined(PB2)
#if defined(CELSIUS)
	setpoint2 = setpoint + (error_integrator >> 8);
#else
	setpoint2 = setpoint + (error_integrator >> 7);
#endif
#endif
	// Set LED outputs
	led_e.e_cool = !LATA4;
	led_e.e_heat = !LATA5;

