matsstaff/stc1000p/src/page0.c
	// Interpolate between lookup table points
	for (i = 0; i < 64; i++) {
		unsigned char ofs = 0;
		if(a > i) {
			ofs = 1;
		}
		temp += ad_lookup[b + ofs];
	}

	// Divide by 64 to get back to normal temperature
	return (temp >> 6);
}

#if defined(RH)
static unsigned char ad_to_rh(unsigned int adfilter){
	int rh = (adfilter >> FILTER_SHIFT) - AD_0_RH;	
	rh = (rh >> 3) + (rh >> 5);
	rh += eeprom_read_config(EEADR_MENU_ITEM(rhc));
	if(rh < 0){
		rh = 0;
	} else if(rh > 100){
		rh = 100;
	}
	return rh;
}

static unsigned char limithist=0;
static unsigned char hcount = 0;
static void control_rh(){

	unsigned humlimit = 100;
	
	if(temperature > 0 && temperature < 500){
		unsigned char i=0, j;
		int t = temperature;
		int rh=0;
		while(t >= 50) {
			t -= 50;
			i++;
		}
		t <<= 2;
		for(j=0; j<8; j++){
			if(t>=25){
				t-=25;
				rh+=eeprom_read_config(i+1);
			} else {
				rh+=eeprom_read_config(i);
			}
		}
		humlimit = (rh >> 3);
	}

	limithist = (limithist << 1) | (humidity > humlimit);

	{
		unsigned char ones=0;
		unsigned char c = limithist;
		while(c){
			if(c & 1){
				ones++;
			}
			c = (c >> 1);
		}

		if(HEATING){
			HUMID = (ones > 2);
		} else {
			HUMID = (ones > 5);
		}
	}

	if(hcount==0){
		if(wait!=0){
			wait--;
		}

		if(HEATING){
			unsigned char cntadr = EEADR_COUNTER(eeprom_read_config(EEADR_COUNTER_INDEX));
			if(!HUMID){
				if(wait==0){
					HEATING = 0;
					wait = eeprom_read_config(EEADR_MENU_ITEM(don));
				}
			}
			eeprom_write_config(cntadr, eeprom_read_config(cntadr) + 1);
		} else {
			if(!HUMID) {
				wait = eeprom_read_config(EEADR_MENU_ITEM(don));
			} else if(wait==0){
				HEATING = 1;
				wait = eeprom_read_config(EEADR_MENU_ITEM(dff));
			}
		}
	}
	hcount=((hcount+1) & 0x7);

	LATA4 = HEATING;
	LATA5 = HEATING;

	led_e.e_cool = !HEATING;
	led_e.e_heat = !HEATING;
}

#endif // RH

#if defined(COM)


/* State machine to handle rx/tx protocol */
static void handle_com(unsigned const char rxdata){
	static unsigned char command;
	static unsigned char xorsum;
	static unsigned char addr;
	static word_lo_hi_t data;
	
	xorsum ^= rxdata;

	state_flags.com_write = 0;

	// note below that compound states can exist, but only the most recent state bit is handled
	if(!com_state.raw){
		command = rxdata;
		xorsum = rxdata;
		addr = 0;
		if(command == COM_READ_EEPROM || command == COM_WRITE_EEPROM){
			com_state.com_recv_addr = 1;
		} else if(rxdata == COM_READ_TEMP){
			data.word = temperature;
			com_state.com_trans_data1 = 1;
		} else if(rxdata == COM_READ_COOLING){
			data.lo = LATA4;
			data.hi = 0;
			com_state.com_trans_data1 = 1;
		} else if(rxdata == COM_READ_HEATING){
			data.lo = LATA5;
			data.hi = 0;
			com_state.com_trans_data1 = 1;
		} // else timeout?
	} else if(com_state.com_recv_checksum){
		com_state.raw = 0;
		if(xorsum == 0){
			eeprom_write_config(addr, data.word);
			com_data = COM_ACK;
		} else {
			com_data = COM_NACK;
		}
		state_flags.com_write = 1;
	} else if(com_state.com_recv_data2) {
		com_state.com_recv_checksum = 1;
		data.lo = rxdata;
	} else if(com_state.com_recv_data1) {
		com_state.com_recv_data2 = 1;
		data.hi = rxdata;
	} else if(com_state.com_trans_ack){
		com_state.raw = 0;
		com_data = COM_ACK;
		state_flags.com_write = 1;
	} else if(com_state.com_trans_checksum){
		com_state.com_trans_ack = 1;
		com_data = command ^ addr ^ data.hi ^ data.lo;
		state_flags.com_write = 1;
	} else if(com_state.com_trans_data2){
		com_state.com_trans_checksum = 1;
		com_data = data.lo;
		state_flags.com_write = 1;
	} else if(com_state.com_recv_addr){
		addr = rxdata;
		if(command == COM_WRITE_EEPROM){
			com_state.com_recv_data1 = 1;
		} else {
			com_state.com_trans_data1 = 1;
			data.word = eeprom_read_config(addr);
		}	
	}

	if(com_state.com_trans_data1){
		com_data = data.hi;
		state_flags.com_write = 1;
		com_state.com_trans_data2 = 1;
	}
}

#elif defined(FO433)

enum fo433_states {
	fo433_preamble=0,
	fo433_devid_high,
	fo433_devid_low_temp_high,
	fo433_temp_low,
	fo433_humidity,
	fo433_crc
};

/* Fine offset state machine */
static void fo433_fsm(){
	static int t;
	static unsigned char crc;

	if(fo433_state == fo433_preamble){
		fo433_data = 0xff;
	} else if(fo433_state == fo433_devid_high){
		fo433_data = 0x45;
		crc = 0;
	} else if(fo433_state == fo433_devid_low_temp_high){
		unsigned char di = ((unsigned char)eeprom_read_config(EEADR_MENU_ITEM(dI))) << 4;
		t = temperature;
		fo433_data = (di | ((t >> 8) & 0xf));
	} else if(fo433_state == fo433_temp_low){
		fo433_data = (unsigned char) t;
	} else if(fo433_state == fo433_humidity){
		fo433_data = (LATA5 << 6) | (LATA4 << 4);
	} else if(fo433_state == fo433_crc){
		fo433_data = crc;
	}

	// Calc CRC
	{
		unsigned char i=8;
		unsigned char d = fo433_data;
		while(i-- > 0){
			unsigned char mix = (crc ^ d) & 0x80;
			crc <<= 1;
			if(mix){
				crc ^= 0x31;
			}
			d <<= 1;
		}
	}

	fo433_count = 0x80;

	/* Enable timer 0 */
	TMR0IE = 1;
	TMR0CS = 0;
}
#endif // FO433

/*
 * Main entry point.
 */
void main(void) __naked {
	unsigned int millisx60 = 0;
	unsigned int ad_filter = (512L << FILTER_SHIFT);
#if defined(PB2) || defined(RH)
	unsigned int ad_filter2 = (512L << FILTER_SHIFT);
#endif

	init();

	START_TCONV_1();

	//Loop forever
	while (1) {

#if defined(COM)
		/* Handle communication if full byte transmitted/received */
		GIE = 0;
		if(com_count >= 8){
			char rxdata = com_data;
			com_count = 0;
			GIE = 1;
 			handle_com(rxdata);
		}
		GIE = 1;
#elif defined(FO433)
		/* Send next byte */
		if((fo433_state <= fo433_crc) && (fo433_count == 0)){
			fo433_fsm();
			fo433_state++;
		}
#endif

		if(TMR6IF) {

			// Handle button press and menu
			button_menu_fsm();

			if(!TMR4ON){
				led_e.raw = LED_OFF;
				led_10.raw = LED_O;
				led_1.raw = led_01.raw = LED_F;
			}

			// Reset timer flag
			TMR6IF = 0;
		}

#if defined(OVBSC)
		if(oc==0){
			oc = eeprom_read_config(EEADR_MENU_ITEM(Pd));
			output_control();
		}
#endif

		if(TMR4IF) {

			millisx60++;

			if(millisx60 & 0x1){
				ad_filter = read_ad(ad_filter);
#if (defined(PB2) || defined(RH))
				START_TCONV_2();
			} else {
				ad_filter2 = read_ad(ad_filter2);
#endif
				START_TCONV_1();
			}

			// Only run every 16th time called, that is 16x60ms = 960ms
			// Close enough to 1s for our purposes.
			if((millisx60 & 0xf) == 0) {

				temperature = ad_to_temp(ad_filter) + eeprom_read_config(EEADR_MENU_ITEM(tc));
#if defined(PB2)
				temperature2 = ad_to_temp(ad_filter2) + eeprom_read_config(EEADR_MENU_ITEM(tc2));
#endif
#if defined(RH)
				humidity = ad_to_rh(ad_filter2);
#endif

#if defined(FO433)
				if(fo433_sec_count < 3){
					fo433_state = 0;
				}
				if(fo433_sec_count == 0){
					fo433_sec_count = 48;
				}
				fo433_sec_count--;
#endif

#if defined(OVBSC)
				program_fsm();
				temperature_control();

				if(MENU_IDLE){
					if(ALARM && (millisx60 & 0x10)){
						led_10.raw = al_led_10.raw;
						led_1.raw = al_led_1.raw;
						led_01.raw = al_led_01.raw;
					} else {
						if(RUN_PRG && (prg_state == prg_boil || prg_state == prg_wait_strike)){
							int_to_led(countdown);
						} else {
							temperature_to_led(temperature);
						}
					}
				}

				if(millisx60 >= 1000){
					millisx60 = 8;
				}

#elif defined(RH)
				// Control RH every 7.5 min
				if(millisx60 >= 7500){
					control_rh();
					millisx60 = 0;
				}

				if(MENU_IDLE){
					unsigned char show_r_t = eeprom_read_config(EEADR_MENU_ITEM(Srt));
					led_e.e_set = !((HEATING ^ HUMID) && (millisx60 & 0x10));
					if((show_r_t == 0x2) || ((show_r_t & 0x2) && (millisx60 & 0x20))){
						int_to_led(humidity);
					} else if(show_r_t & 0x1){
						temperature_to_led(temperature);
					} else {
						led_01.raw = led_1.raw = led_10.raw = LED_OFF;
					}
				}
#else
				// Alarm on sensor error (AD result out of range)
				if (state_flags.ad_badrange) {
					LATA0 = 1;
				} else {
					LATA0 = 0;
				}
				// unlatch badrange flag for next iteration
				state_flags.ad_badrange = 0;

