matsstaff/stc1000p/src/page0.c
				if(LATA0){ // On alarm, disable outputs
					if(MENU_IDLE){ // Make it less anoying to nagivate menu during alarm
						led_10.raw = LED_A;
						led_1.raw = LED_L;
						led_e.raw = led_01.raw = LED_OFF;
					}
					LATA4 = 0;
					LATA5 = 0;
					cooling_delay = heating_delay = 60;
				} else {
					// Update running profile every hour (if there is one)
					// and handle reset of millis x60 counter
					if(((unsigned char)eeprom_read_config(EEADR_MENU_ITEM(rn))) < THERMOSTAT_MODE){
						// Indicate profile mode
						led_e.e_set = 0;
#if defined(MINUTE)
						// Update profile every minute
						if(millisx60 >= 1000){
							update_profile();
							millisx60 = 8;
						}
#else
						// Update profile every hour
						if(millisx60 >= 60000){
							update_profile();
							millisx60 = 0;
						}
#endif
					} else {
						led_e.e_set = 1;
						millisx60 = 0;
					}

					{
						int sa = eeprom_read_config(EEADR_MENU_ITEM(SA));
						if(sa){
#if defined(MINUTE)
							int diff = temperature - setpoint;
#else
							int diff = temperature - eeprom_read_config(EEADR_MENU_ITEM(SP));
#endif
							if(diff < 0){
								diff = -diff;
							} 
							if(sa < 0){
								sa = -sa;
								LATA0 = diff <= sa;
							} else {
								LATA0 = diff >= sa;
							}
						}
					}

					// Run thermostat
					temperature_control();

					// Show temperature if menu is idle
					if(MENU_IDLE){
						if(LATA0 && SHOW_SA_ALARM){
							led_10.raw = LED_S;
							led_1.raw = LED_A;
							led_01.raw = LED_OFF;
						} else {
#if defined(PB2)
							led_e.e_point = !SENSOR_SELECT;
							if(SENSOR_SELECT){
								temperature_to_led(temperature2);
							} else {
								temperature_to_led(temperature);
							}
#else
							temperature_to_led(temperature);
#endif
						}
						SHOW_SA_ALARM = !SHOW_SA_ALARM;
					}
				}
#endif // !OVBSC
			} // End 1 sec section

			// Reset timer flag
			TMR4IF = 0;
		}

		// Reset watchdog
		ClrWdt();
	}
}
